app/views/comments/index.html.haml

SELECT `comments`.* FROM `comments` ORDER BY created_at DESC
---
    %ul.wat-cf
      %li.first.active= link_to "Comments", "#"
  .content
    .inner