app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` ORDER BY created_at DESC
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` IN (10)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)
---
  def index
    @comments = Comment.includes([:gallery,:user]).all

SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 10 LIMIT 1
INSERT INTO `comments` (`created_at`, `gallery_id`, `message`, `updated_at`, `user_id`) VALUES ('2012-01-23 15:11:51', 10, 'vbnvbncvbn', '2012-01-23 15:11:51', 1)
---
  def create
    img = Gallery.find_by_id(params[:gallery_id])
    current_user.comments.create(:gallery => img, :message => params[:comment][:message])