app/controllers/events_controller.rb

SELECT `events`.* FROM `events` GROUP BY user
---
  def index
    @events = Event.group(:user)

SELECT `events`.* FROM `events` WHERE (name = 'user-navigation' and user ='qwerty@mail.com' )
---
  def show
    @name = params[:id]
    @user = params[:user]
    @event = Event.where("name = ? and user =? ",@name, @user)