app/controllers/galleries_controller.rb

SELECT COUNT(*) FROM `galleries`
SELECT `galleries`.* FROM `galleries` ORDER BY likes_count DESC LIMIT 30 OFFSET 0
---
  def all_img
    @galleries = Gallery.order("likes_count DESC").paginate(:page => params[:page])

INSERT INTO `likes` (`created_at`, `gallery_id`, `updated_at`, `user_id`) VALUES ('2012-01-23 15:12:30', 4, '2012-01-23 15:12:30', 1)
---
  def like
    like = @gallery.likes.build(:user_id => current_user.id)
    flash[:error] = "Error" unless like.save

SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 4 LIMIT 1
---
  def find_image
    @gallery = Gallery.find(params[:id])