app/views/galleries/show.html.haml

SELECT `comments`.* FROM `comments` WHERE `comments`.`gallery_id` = 3 ORDER BY created_at DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)
---
    .inner
      - @gallery.comments.includes(:user).each do |comment|
        .comment
          .login