app/views/categories/index.html.haml

SELECT `categories`.* FROM `categories`
---
    %ul.wat-cf
      %li.first.active= link_to "Categories", categories_path
  .content